src/Documents/КАЗ_ПлатежноеПоручениеИсходящее/КАЗ_ПлатежноеПоручениеИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ПлатежноеПоручениеИсходящее</name>
  <registerRecords>AccumulationRegister.КАЗ_ФактическиеПлатежи</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КАЗ_ЗаявкаНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/КАЗ_ШаблоныНазначенияПлатежа/КАЗ_ШаблоныНазначенияПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАЗ_ШаблоныНазначенияПлатежа</name>
  <attributes>
    <name>СтатьяПлатежа</name>
    <type>
      <types>CatalogRef.КАЗ_СтатьиПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначенияПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/КАЗ_ПлатежноеПоручениеИсходящее/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		Возврат;
	КонецЕсли;

	ДанныеЗаявки = ПолучитьДанныеЗаявкиНаСервере(Объект.Заявка);

	Объект.Сумма = ДанныеЗаявки.Сумма;

	Если Не ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		Объект.СчетОрганизации = ПервыйСчетОрганизацииНаСервере();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.НазначениеПлатежа) И ЗначениеЗаполнено(ДанныеЗаявки.ТекстШаблона) Тогда
		Объект.НазначениеПлатежа = ДанныеЗаявки.ТекстШаблона;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаявкиНаСервере(Заявка)

	Результат = Новый Структура("Сумма, ТекстШаблона", 0, "");
	Результат.Сумма = Заявка.СуммаДокумента;

	Если ЗначениеЗаполнено(Заявка.СтатьяПлатежа) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Шаблоны.ТекстНазначенияПлатежа КАК ТекстНазначенияПлатежа
		|ИЗ
		|	Справочник.КАЗ_ШаблоныНазначенияПлатежа КАК Шаблоны
		|ГДЕ
		|	Шаблоны.СтатьяПлатежа = &СтатьяПлатежа
		|	И НЕ Шаблоны.ПометкаУдаления
		|	И НЕ Шаблоны.ЭтоГруппа";

		Запрос.УстановитьПараметр("СтатьяПлатежа", Заявка.СтатьяПлатежа);

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() Тогда
			Результат.ТекстШаблона = Выборка.ТекстНазначенияПлатежа;
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция ПервыйСчетОрганизацииНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Счета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КАЗ_БанковскиеСчетаОрганизации КАК Счета
	|ГДЕ
	|	НЕ Счета.ПометкаУдаления
	|	И НЕ Счета.ЭтоГруппа";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.КАЗ_БанковскиеСчетаОрганизации.ПустаяСсылка();

КонецФункции
